tap "homebrew/bundle"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text processing system for reStructuredText
brew "docutils"
# General framework for graph optimization
brew "g2o"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript", link: false
# Distributed revision control system
brew "git"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Data compression library
brew "lzlib"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk", link: false
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Implementation of the Language Server Protocol for LaTeX
brew "texlab"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Full TeX Live distribution with GUI applications
cask "mactex"
