tap "homebrew/bundle"

# OS
brew "cmake"
brew "ripgrep"
brew "tmux"
cask "mactex"
brew "neovim"
brew "texlab"
brew "universal-ctags"
brew "openssl"
brew "p11-kit"
brew "cask"
brew "brew-cask-completion"
brew "docutils"
brew "openjpeg"
brew "zsh"
brew "zsh-completions"
brew "sphinx-doc"
brew "libtiff"
brew "wget"
brew "git"
brew "fzy"
brew "fzf"
brew "lzlib"
brew "libfido2"
brew "gpatch"
brew "opam"

# Utilities
brew "bat"
brew "pandoc"
brew "tree"
brew "httpie"
brew "fd"
brew "g2o"
brew "little-cms2"
brew "ghostscript", link: false
cask "grandperspective"

# Databases
brew "postgresql@11"
brew "mysql-client"
brew "mysql"
