# specify a directory to install
cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap "homebrew/services"
tap 'caskroom/homebrew-cask' || true

# OS
brew 'cmake'
brew 'ripgrep'
brew 'tmux'
brew 'neovim'
brew 'texlab'
brew 'universal-ctags'
brew 'openssl'
brew 'p11-kit'
brew 'cask'
brew 'brew-cask-completion'
brew 'docutils'
brew 'openjpeg'
brew 'zsh'
brew 'zsh-completions'
brew 'sphinx-doc'
brew 'libtiff'
brew 'wget'
brew 'git'
brew 'fzy'
brew 'fzf'
brew 'lzlib'
brew 'libfido2'
brew 'gpatch'
brew 'opam'
brew "libtiff"
brew "dbus"
brew "bat"
brew "fd"
brew "g2o"
brew "little-cms2"
brew "openjpeg"
brew "ghostscript", link: false
brew "gpatch"
brew "libfido2"
brew "lua"
brew "mackup"
brew "mysql-client"
brew "mysql@5.7"
brew "node"
brew "nvm"
brew "openssh"
brew "postgresql@11"
brew "powerlevel10k"
brew "ripgrep"
brew "rust"

# Utilities
brew "sphinx-doc"
brew 'bat'
brew 'pandoc'
brew 'tree'
brew 'httpie'
brew 'fd'
brew 'g2o'
brew 'little-cms2'
brew 'ghostscript', link: false

# Databases
brew 'postgresql@11'
brew 'mysql-client'
brew 'mysql'

# Casks
cask 'firefox'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'zoom'
cask 'anki'
cask 'bitwarden'
cask 'macs-fan-control'
cask 'mactex'
cask 'grandperspective'
cask 'microsoft-word'
cask 'microsoft-powerpoint'
cask 'microsoft-outlook'
cask 'microsoft-excel'
cask 'onedrive'
cask 'todoist'
cask 'visual-studio-code'
cask 'notion'
cask 'logitech-options'
cask 'raycast'
cask 'obsidian'
